chensheng12330/STC32GWithDragon/STC32G-布丁橘长-20230510/119-EEPROM-基本操作（读、写、擦除）-不停电下载（USB-HID方式）/119-EEPROM-基本操作（读、写、擦除）-不停电下载（USB-HID方式）/main.c
//	@布丁橘长 2023/04/05
// 	EEPROM基本操作示例，并使用USB-HID不停电下载（开发板直连电脑，不需要下载器）
//  仅演示EEPROM读、写、擦除操作，无实验现象
//  使用STC-ISP软件，点击发送用户自定义命令并开始下载，
//	或点击下载按钮，即可自动下载，无需按住P3.2和OFF按键（第一次下载需要按P3.2和OFF）
//	实验开发板：STC32G12K128屠龙刀三.1 主频@12MHz

#include <STC32G.H>
#include "config.h"
#include "usb.h"
#include "EEPROM.h"

#define MAIN_Fosc 12000000UL		//定义主频12MHz，请根据实际使用频率修改

void sysini(void);						// STC32初始化设置
void Timer0_Init(void);				// 定时器0初始化	
void Blink(void);							// LED闪烁函数，此处为P2口流水灯效果

//USB调试及复位所需定义
char *USER_DEVICEDESC = NULL;
char *USER_PRODUCTDESC = NULL;
char *USER_STCISPCMD = "@STCISP#"; 	//设置自动复位到ISP区的用户接口命令

bit B_1ms;										// 1ms标志

void main(void)
{
	sysini();										// STC32初始化设置
	Timer0_Init();							// 定时器0初始化
	
//------USB调试及复位所需代码-----
  P3M0 &= ~0x03;
  P3M1 |= 0x03;
  IRC48MCR = 0x80;
  while (!(IRC48MCR & 0x01));
	usb_init();
//--------------------------------
	EA = 1;											// 使能EA总中断


//-------------EEPROM写操作，在第10扇区，第0字节，写入0x10-----------
	IapProgram(SECTOR10,0x10);

	
//-------------EEPROM读操作，读取第3扇区，第20字节-------------------
	IapRead(SECTOR3 + 20);
	
	
//-------------EEPROM擦除操作，擦除第3扇区---------------------------
	IapErase(SECTOR3);	

//-------------修改第10扇区，第0字节数据-----------------------------
	IapErase(SECTOR10);					// 先擦除第10扇区						
	IapProgram(SECTOR10,0x11);	// 在第10扇区，第0字节，写入0x11

	
	while(1);
}
void sysini()
{
	EAXFR = 1; 									// 使能访问 XFR
	CKCON = 0x00; 							// 设置外部数据总线速度为最快
	WTST = 0x00;								// 设置程序代码等待参数，等待时间为0个时钟，CPU执行程序速度最快

	P0M1 = 0xFF;P0M0 = 0x00;		// 设置P0口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P1M1 = 0x00;P1M0 = 0x00;		// 设置P1口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P2M1 = 0x00;P2M0 = 0x00;		// 设置P2口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P3M1 = 0x00;P3M0 = 0x00;		// 设置P3口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P4M1 = 0x00;P4M0 = 0x00;		// 设置P4口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P5M1 = 0x00;P5M0 = 0x00;		// 设置P5口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P6M1 = 0x00;P6M0 = 0x00;		// 设置P6口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P7M1 = 0x00;P7M0 = 0x00;		// 设置P7口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
}

void Timer0_Isr(void) interrupt 1
{
	B_1ms = 1;									// 提供1毫秒节拍，可用于延时计数
	//------USB调试及复位所需代码------		
		if (bUsbOutReady) 
    {
        usb_OUT_done();
    }
//--------------------------------
}
void Timer0_Init(void)				//1毫秒@12.000MHz
{
	AUXR |= 0x80;								//定时器时钟1T模式
	TMOD &= 0xF0;								//设置定时器模式
	TL0 = 0x20;									//设置定时初始值
	TH0 = 0xD1;									//设置定时初始值
	TF0 = 0;										//清除TF0标志
	TR0 = 1;										//定时器0开始计时
	ET0 = 1;										//使能定时器0中断
}